export type Patters = ReadonlyArray<{ title: string; content: string[] }>;

const title = 'Скороговорки на отработку звуков';

export const patters: Patters = [
  {
    title: `${title} б, п, в, ф, г, к, д, т, х`,
    content: ['Добыл бобов бобыль.', 'От топота копыт пыль по полю летит.',
      'Бык тупогуб, тупогубенький бычок, у быка бела губа была тупа.',
      'Колпак на колпаке, под колпаком колпак.', 'Верзила Вавила весело ворочал вилы.',
      'Около кола колокола, около ворот коловорот.', 'Шакал шагал, шакал скакал.',
      'Купи кипу пик. Купи кипу пуха.', 'Ткёт ткач ткани на платке Тани.', 'Водовоз вёз воду из-под водопровода.',
      'Наш голова вашего голову головой переголовил, перевыголовил.', 'В один, Клим, клин колоти.',
      'Стоит копна с подприкопёночком.', 'В поле полет Фрося просо, сорняки выносит Фрося.',
      'Краб крабу сделал грабли. Подал грабли крабу краб: сено граблями, краб, грабь!', 'У ёлки иголки колки.',
      'Кукушка кукушонку купила капюшон. Надел кукушонок капюшон, как в капюшоне он смешон!',
      'Все бобры для своих бобрят добры. Бобры берут для бобрят бобы. Бобры, бывает, будоражат бобрят, давая им бобы.',
      'Забыл Панкрат Кондратов домкрат, а Панкрату без домкрата не поднять на тракте трактор.', 'На меду медовик, а мне не до медовика.',
      'Пришёл Прокоп, кипел укроп, ушёл Прокоп, кипел укроп: как при Прокопе кипел укроп, так и без Прокопа кипел укроп.',
      'Волховал волхв в хлеву с волхвами.', 'Бомбардир бонбоньерками бомбардировал барышень.', 'У Феофана Митрофаныча три сына Феофанычи.',
      'У нас гость унёс трость.', 'Фараонов фаворит на сапфир сменил нефрит.', 'Рододендроны из дендрария даны родителями.',
      'К Габсбургам из Страсбурга.', 'Сидел тетерев на дереве, а тетёрка с тетеревятами на ветке.',
      'Брит Клим брат, брит Глеб брат, брат Игнат бородат.', 'Хвалю халву.']
  },
  {
    title: `${title} р, л, м, н`,
    content: ['Дробью по перепелам да по тетеревам.', 'У нас на дворе-подворье погода размокропогодилась.',
      'Два дровосека, два дровокола, два дроворуба говорили про Ларьку, про Варьку, про Марину жену.',
      'Клара-краля кралась с крокодилом к Ларе.',
      'Говорил командир про полковника и про полковницу, про подполковника и про подполковницу, про поручика и про поручицу, про подпоручика и про подпоручицу, про прапорщика и про прапорщицу, а про подпрапорщицу промолчал.',
      'На дворе трава, на траве дрова. Не руби дрова на траве двора.',
      'Курфюрст скомпрометировал ландскнехта.', 'Рапортовал да недорапортовал, дорапортовывал да зарапортовался.',
      'Рыла свинья белорыла, тупорыла; полдвора рылом изрыла, вырыла, подрыла.',
     ' Съел молодец тридцать три пирога с пирогом, да все с творогом.',
      'Тридцать три корабля лавировали, лавировали, да не вылавировали.',
      'Карл у Клары украл кораллы, а Клара у Карла украла кларнет.',
      'Королева Клара строго карала Карла за кражу коралла.', 'Карл клал лук на ларь.', 'Клара крала лук с ларя.',
      'Всех скороговорок не перескороговоришь, не перевыскороговоришь.',
      'Мамаша Ромаше дала сыворотку из-под простокваши.', 'Расскажите про покупки. Про какие про покупки? Про покупки, про покупки, про покупочки свои.',
      'Сшит колпак, да не по-колпаковски; вылит колокол, да не по-колоколовски.',
      'Надо колпак переколпаковать, перевыколпаковать, надо колокол переколоколовать, перевыколоколовать.',
      'Протокол про протокол протоколом запротоколировали.', 'Была у Фрола, Фролу на Лавра наврала. Подойду к Лавру, на Фрола Лавру навру.', 'Король – орёл.',
      'Курьера курьер обгоняет в карьер.', 'Маланья-болтунья молоко болтала, выбалтывала, да не выболтала.',
      'Полили ли лилию? Видели ли Лидию? Полили лилию, видели Лидию.', 'Гонец с галер сгорел.', 'Идти на рать, так бердыш брать.',
      'Наш Полкан из Байкала лакал. Полкан лакал, но не мелел Байкал.',
      'Мы ели, ели ершей у ели, их еле-еле у ели доели.',
      'Не жалела мама мыла. Мама Милу мылом мыла. Мила мыла не любила, мыло Мила уронила.', 'Во мраке раки шумят в драке.',
      'Орёл на горе, перо на орле. Гора под орлом, орёл под пером.', 'Город Нерль на Нерли-реке.',
      'На горе Арарат рвала Варвара виноград.', 'Из-под Костромы, из-под костромщины шли четыре мужчины.',
      'Вахмистр с вахмистршей, ротмистр с ротмистршей.',
      'Турка курит трубку, курка клюёт крупку. Не кури, турка, трубку, не клюй, курка, крупку.', 'А мне не до недомогания.']
  },
  {
    title: `${title} с, з, ш, ж, ч, щ, ц`,
    content: ['У Сени и Сани в сетях сом с усами.', 'У осы не усы, не усища, а усики.', 'Везёт Сенька Саньку с Сонькой на санках. Санки скок, Сеньку с ног, Саньку в бок, Соньку в лоб, все в сугроб.', 'Осип охрип, Архип осип.',
      'Не хочет косой косить косой, говорит, коса коса.', 'Сачок зацепился за сучок.', 'Но семеро в сани уселися сами.',
      'Из кузова в кузов шла перегрузка арбузов. В грозу в грязи от груза арбузов развалился кузов.',
      'Свиристель свиристит свирелью.', 'Шла Саша по шоссе и сосала сушку.',
      'Шли сорок мышей, нашли сорок грошей, две мыши поплоше нашли по два гроша. Шестнадцать шли мышей и шесть нашли грошей, а мыши, что поплоше, шумливо шарят гроши.',
      'Четверть четверика гороха без червоточинки.', 'Инцидент с интендантом. Прецедент с претендентом.',
      'Константин констатировал.', 'У ежа ежата, у ужа ужата.', 'Жутко жуку жить на суку.',
      'Два щенка щека к щеке щиплют щётку в уголке.', 'Тщетно тщится щука ущемить леща.',
      'Жужжит жужелица, жужжит, да не кружится.', 'Яшма в замше замшела.']
  }
];
