export type SoundsType = ReadonlyArray<string[]>;

export const sounds: SoundsType = [
  [
    'и э а о у ы е я ё ю'
  ],
  [
    'и-э и-а и-о и-у',
    'э-о э-у э-а э-и',
    'а-о а-у а-и а-ы',
    'о-ы о-и о-э о-у',
    'у-о у-и у-ы у-а'
  ],
  [
    'а э и о у ы',
    'э и о у ы а',
    'и о у ы а э',
    'о у ы а э и',
    'у ы а э и о',
    'ы а э и о у',
  ],
  [
    'пи пэ па по пу пы',
    'би бэ ба бо бу бы',
    'пи-бби пэ-ббэ па-бба',
    'по-ббо пу-ббу пы-ббы',
    'пе пя пё пю бе бя бё бю',
  ],
  [
    'ки кэ ка ко ку кы',
    'ик эк ак ок ук ык',
    'ги гэ га го гу гы',
    'иг эг аг ог уг ыг',
  ],
  [
    'ти тэ та то ту ты',
    'ит,эт ат от ут ыт',
    'ди дэ да до ду ды',
    'ид эд ад од уд ыд',
  ],
  [
    'фи фэ фа фо фу фы',
    'ви вэ ва во ву вы',
    'фиви фэвэ фава фово фуву фывы',
    'вифи вэфэ вафа вофо вуфу выфы',
  ],
  [
    'ри рэ ра ро ру ры',
    'ир эр ар ор ур ыр',
    'трри тррэ трра трро трру трры',
    'дрри дррэ дрра дрро дрру дрры',
  ],
  [
    'ли лэ ла ло лу лы',
    'ил эл ал ол ул ыл',
    'ли ле ля лё лю лы',
    'лилл лэлл лалл лолл лулл лылл',
  ],
  [
    'три тре тря трё трю тры',
    'дри дре дря дрё дрю дры',
    'дли длэ дла дло длу длы',
    'тли тлэ тла тло тлу тлы',
  ],
  [
    'си сэ са со су сы',
    'зи зэ за зо зу зы',
    'сти стэ ста сто сту сты',
    'зди здэ зда здо зду зды',
  ],
  [
    'си се ся сё сю сы',
    'зи зе зя зё зю зи',
    'сти сте стя стё стю сты',
    'зди зде здя здё здю зды',
  ],
  [
    'ши ше ша шо шу',
    'лши лше лша лшо лшу',
    'лжи лже лжа лжо лжу',
  ],
  [
    'хи хэ ха хо ху хы',
    'их эх ах ох ух ых',
    'хви хвэ хва хво хву хвы',
    'ххи ххэ хха ххо хху ххы',
  ],
  [
    'уи уэ уа уо уу уы',
    'иу эу ау оу ыу',
    'чи че ча чо чу',
    'ич еч ач оч уч ыч',
  ]
];
